# CeilingAttrSpacing2Param Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CeilingAttrSpacing2Param Property
ParameterTypeId Class See Also
---
"Spacing Axis 2"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CeilingAttrSpacing2Param { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CeilingAttrSpacing2Param As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CeilingAttrSpacing2Param {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace